src/usr/share/man/nl/man8/explodepkg.8
.\" empty
.ds g 
.\" -*- nroff -*-
.\" empty
.ds G 
.de  Tp
.ie \\n(.$=0:((0\\$1)*2u>(\\n(.lu-\\n(.iu)) .TP
.el .TP "\\$1"
..
.\" Like TP, but if specified indent is more than half
.\" the current line-length - indent, use the default indent.
.\"*******************************************************************
.\"
.\" This file was generated with po4a. Translate the source file.
.\"
.\"*******************************************************************
.TH EXPLODEPKG 8 "21 Mei 1994" "Slackware Versie 2.0.0" 
.SH NAAM
explodepkg \- Decomprimeer de inhoud van een tar+compressie pakket (zoals een
Slackware softwarepakket) in de huidige directory.
.SH SYNOPSIS
\fBexplodepkg\fP \fBpakket\fP \fB[\fP \fBpakket2,\fP \fBpakket3,\fP \fB...\fP \fB]\fP
.SH BESCHRIJVING
\fBexplodepkg\fP decomprimeert en untart Slackware *.tgz (of .tbz, .tlz, .txz)
pakketten (of elk ander archief gemaakt door compressie van een tar bestand
met een ondersteunde compressietechniek) in de huidige directory. Wordt
gewoonlijk niet gebruikt om pakketten te installeren omdat het
installatiescripts in ./install of ./var/log/setup niet uitvoert. Het
primaire gebruik van \fBexplodepkg\fP is bij pakketonderhoud \- uitpakken van
een pakket in een subdirectory, veranderen of verbeteren van de software, en
hierna een geüpdate pakket maken met \fBmakepkg.\fP
.SH AUTEUR
Patrick J. Volkerding <volkerdi@slackware.com>
.SH "ZIE OOK"
\fBtar(1),\fP \fBgzip(1),\fP \fBinstallpkg(8),\fP \fBmakepkg(8),\fP \fBpkgtool(8),\fP
\fBupgradepkg(8)\fP
