src/usr/share/man/id/man8/explodepkg.8
.\" empty
.ds g 
.\" -*- nroff -*-
.\" empty
.ds G 
.de  Tp
.ie \\n(.$=0:((0\\$1)*2u>(\\n(.lu-\\n(.iu)) .TP
.el .TP "\\$1"
..
.\" Like TP, but if specified indent is more than half
.\" the current line-length - indent, use the default indent.
.\"*******************************************************************
.\"
.\" This file was generated with po4a. Translate the source file.
.\"
.\"*******************************************************************
.TH EXPLODEPKG 8 "21 May 1994" "Slackware Versi 2.0.0" 
.SH NAMA
explodepkg \- Mengekstraksi isi dari paket terkompresi tar (seperti paket
software Slackware) pada direktori aktual.
.SH SINOPSIS
\fBexplodepkg\fP \fBpaket\fP \fB[\fP \fBpaket2,\fP \fBpaket3,\fP \fB...\fP \fB]\fP
.SH DESKRIPSI
\fBexplodepkg\fP men\-dekompresi dan membuka paket *.tgz Slackware (atau .tbz,
\&.tlz, .txz)  (atau sembarang arsip yang dibuat dengan mengkompresi file tar
dengan salah satu utilitas kompresi yang didukung) pada direktori
aktual. Biasanya tidak digunakan untuk menginstall paket, karena tidak
menjalankan script installasi pada ./install atau ./var/log/setup. Fungsi
utama dari \fBexplodepkg\fP adalah untuk perawatan paket \- membongkar paket
pada sub direktori, membuat perbaikan, atau mengupgrade software, lalu
membangun paket yang terupdate dengan \fBmakepkg.\fP
.SH PEMBUAT
Patrick J. Volkerding <volkerdi@slackware.com>
.SH "LIHAT JUGA"
\fBtar(1),\fP \fBgzip(1),\fP \fBinstallpkg(8),\fP \fBmakepkg(8),\fP \fBpkgtool(8),\fP
\fBupgradepkg(8)\fP
