src/usr/share/man/sv/man8/pkgtool.8
.\" empty
.ds g 
.\" -*- nroff -*-
.\" empty
.ds G 
.de  Tp
.ie \\n(.$=0:((0\\$1)*2u>(\\n(.lu-\\n(.iu)) .TP
.el .TP "\\$1"
..
.\" Like TP, but if specified indent is more than half
.\" the current line-length - indent, use the default indent.
.\"*******************************************************************
.\"
.\" This file was generated with po4a. Translate the source file.
.\"
.\"*******************************************************************
.TH PKGTOOL 8 "24 Nov 1995" "Slackware Version 3.1.0" 
.SH NAMN
pkgtool \- mjukvarupaket hanterings\-verktyg.
.SH ÖVERSIKT
\fBpkgtool\fP
.LP
\fBpkgtool\fP [ \fB\-\-sets #a#b#c#\fP ] [ \fB\-\-source_mounted\fP ] [
\fB\-\-ignore_tagfiles\fP ] [ \fB\-\-tagfile tagfil\fP ] [ \fB\-\-source_dir katalog\fP ] [
\fB\-\-target_dir katalog\fP ] [ \fB\-\-source_device enhet\fP ]
.SH BESKRIVNING
\fBpkgtool\fP är ett menydrivet paket underhållsverktyg som medföljer Slackware
Linux\-distribution. Den tillåter användaren att installera, ta bort eller
visa programpaket via ett interaktivt system. Pkgtool kan också användas för
att åter köra menystyrda skript i regel i slutet av en Slackware
installation. Detta är användbart för att göra grundläggande omkonfigurering
(som att ändra mus typ).
.SH ALTERNATIV
De flesta användare kommer inte att använda några alternativ när man kör
\fBpkgtool.\fP Dessa används i allmänhet endast när \fBpkgtool\fP körs under den
initiala systeminstallationen. Känn dig fri att prova dem, men var
försiktig.
.TP 
\fB\-\-sets #A#B#C#\fP
Installera diskuppsättningarna A, B, C. Avskilj diskserie\-namn med "#"
symboler.
.TP 
\fB\-\-source_mounted\fP
När denna flagga används, kommer inte \fBpkgtool\fP att försöka avmontera och
montera källenheten med varje skiva.
.TP 
\fB\-\-ignore_tagfiles\fP
När denna flagga används, kommer \fBpkgtool\fP att installera alla paket
oavsett vad tagfilerna säger.
.TP 
\fB\-\-tagfile tagfil\fP
Denna flagga används för att från kommandoraden ange vilken tagfil som skall
användas för installationen.
.TP 
\fB\-\-source_dir katalog\fP
Används vid montering av flera paket från diskuppsättningar. Det är den
katalog där underkataloger för varje disk hittas. Detta används inte vid
installation från diskett.
.TP 
\fB\-\-target_dir katalog\fP
Katalogen där målet rotkatalogen finns. Detta är '/' vid installation på
hårddisken, eller typiskt "/mnt" när du installerar från en
installationsskiva.
.TP 
\fB\-\-source_device enhet\fP
Den källenhet att installera från. Detta används inte om du har anget
\fB\- source_mounted\fP
flaggan. Det används vanligen vid installation från diskett, som i:
\-\-source_device /dev/fd0u1440
eller
\-\-source_device /dev/fd1h1200.
.SH FÖRFATTARE
Patrick J. Volkerding <volkerdi@slackware.com>
.SH "SE OCKSÅ"
\fBmakepkg(8),\fP \fBexplodepkg(8),\fP \fBinstallpkg(8),\fP \fBremovepkg(8),\fP
\fBupgradepkg(8)\fP
