src/usr/share/man/sv/man8/removepkg.8
.\" empty
.ds g 
.\" -*- nroff -*-
.\" empty
.ds G 
.de  Tp
.ie \\n(.$=0:((0\\$1)*2u>(\\n(.lu-\\n(.iu)) .TP
.el .TP "\\$1"
..
.\" Like TP, but if specified indent is more than half
.\" the current line-length - indent, use the default indent.
.\"*******************************************************************
.\"
.\" This file was generated with po4a. Translate the source file.
.\"
.\"*******************************************************************
.TH REMOVEPKG 8 "23 Nov 2001" "Slackware Version 8.1.0" 
.SH NAMN
removepkg \- ta bort Slackware paket.
.SH ÖVERSIKT
\fBremovepkg\fP \fBpaketnamn\fP
.LP
[ \fBROOT=/mnt\fP ] \fBremovepkg\fP [ \fB\-copy\fP ] [ \fB\-keep\fP ] [ \fB\-preserve\fP ] [
\fB\-warn\fP ] \fBpaketnamn\fP
.SH BESKRIVNING
\fBremovepkg\fP tar bort ett tidigare installerat Slackware\-paketet, samtidigt
som en progress skickas till standard ut. Ett paket kan specificeras
antingen av det fullständiga paketnamnet (som du kan se i katalogen
/var/log/packages/), eller av baspaketsnamnet. Exempelvis kan paketet
foo\-1,0\-i486\-1.tgz avlägsnas med vilken som helst av följande kommandon:

removepkg foo\-1.0\-i486\-1.tgz (även igenkända: .tbz, .tlz, .txz)

removepkg foo\-1.0\-i486\-1

removepkg foo.tgz

removepkg foo

När du tar bort filer, kommer \fBremovepkg\fP att analysera innehållet i de
andra paketen som installeras på ditt system, och kommer bara att ta bort
filerna som är unika för paketet. På samma sätt kommer installationsskript
för alla de andra paketen beaktas vid beslut om att inte ta bort symboliska
länkar från förpackningen.
.LP
Ta bort ett paket (samt installera ett) kan vara farlig. Av denna anledning
finns \fB\-warn\fP alternativet. När du använder denna, kommer \fBremovepkg\fP
faktiskt inte ta bort några filer eller länkar, men kommer att skriva ut en
detaljerad rapport om vad det skulle göra om du faktiskt tog bort
paketet. Det föreslås att du gör detta (och kanske matar utmatningen till
\fBless\fP) innan du tar bort paket för att se till att du har
säkerhetskopierat allt som kan vara viktigt.
.LP
När du tar bort ett paket, kommer den ursprungliga filindex att flyttas från
/var/log/packages till /var/log/removed_packages. Likaså kommer
installationsskriptet att flyttas från /var/log/scripts till
/var/log/removed_scripts.
.SH ALTERNATIV
.TP 
\fB\-warn paketnamn\fP
Generera en rapport till standard ut om vilka filer och kataloger som skulle
tas bort, men tar egentligen inte bort paketet.
.TP 
\fB\-preserve paketnamn\fP
Om angivet, rekonstrueras ett komplett paket träd i
/var/log/setup/tmp/preserved_packages/paketnamn.
.TP 
\fB\-copy paketnamn\fP
Skapar en kopia av paketet under
/var/log/setup/tmp/preserved_packages/paketnamn, men tar inte bort
den. (samma effekt som \-warn \-preserve)
.TP 
\fB\-keep\fP
Spara de mellanliggande filer som skapats av removepkg (delete_list,
required_files, uniq_list, del_link_list, required_links,
required_list). Mestadels användbart för felsökning.
.SH " "
Det är möjligt att ta bort ett paket från ett filsystem annan än / genom att
tillföra \fBremovepkg\fP med en \fBROOT\fP miljövariabel:
.TP 
\fBROOT=/mnt removepkg paket\fP

.SH FÖRFATTARE
Patrick J. Volkerding <volkerdi@slackware.com>, med förbättringar av
Christian Franke <c.franke@acm.org>
.SH "SE OCKSÅ"
\fBinstallpkg(8),\fP \fBmakepkg(8),\fP \fBpkgtool(8),\fP \fBupgradepkg(8)\fP
