src/usr/share/man/pl/man8/upgradepkg.8
.\" empty
.ds g 
.\" -*- nroff -*-
.\" empty
.ds G 
.de  Tp
.ie \\n(.$=0:((0\\$1)*2u>(\\n(.lu-\\n(.iu)) .TP
.el .TP "\\$1"
..
.\" Like TP, but if specified indent is more than half
.\" the current line-length - indent, use the default indent.
.\"*******************************************************************
.\"
.\" This file was generated with po4a. Translate the source file.
.\"
.\"*******************************************************************
.TH UPGRADEPKG 8 "31 Maj 2002" "Slackware Wersja 8.1.0" 
.SH NAZWA
upgradepkg \- aktualizuj paczkę systemu Slackware
.SH STRESZCZENIE
\fBupgradepkg\fP [ \fB\-\-dry\-run\fP ] [ \fB\-\-install\-new\fP ] [ \fB\-\-reinstall\fP ] [
\fB\-\-verbose\fP ] \fBnewpackagename\fP \fB[\fP\fInewpackagename2\fP\fB]\fP
.LP
\fBupgradepkg\fP [ \fB\-\-dry\-run\fP ] [ \fB\-\-install\-new\fP ] [ \fB\-\-reinstall\fP ] [
\fB\-\-verbose\fP ] \fBoldpackagename%newpackagename\fP \fB[\fP\fIold2%new2\fP\fB]\fP
.SH OPIS
\fBupgradepkg\fP aktualizuje pakiet Slackware z wersji starej do nowej. Robi to
przez instalację \- \fBINSTALLING\fP nowego pakietu a następnie usunięcie
\fBREMOVING\fP jakichkolwiek plików należących do starego pakiety, które nie są
częścią nowego.  Jeśli stare i nowe pakiety mają tą samą nazwę, potrzebny
jest wyłącznie pojedynczy argument. Jeśli pakiety mają inne nazwy, podaj
nazwę starego pakietu, symbol %, a następnie nazwę nowego pakietu. Nie
dodawaj żadnych spacji pomiędzy parą nazw pakietów.

Jeśli upgradepkg znajdzie więcej niż jeden zainstalowany pakiet
odpowiadający nazwie starego pakietu, wszystkie one zostaną usunięte.
.TP 
Aby aktualizować w katalogu innym niż / (np. w /mnt):
.TP 
ROOT=/mnt upgradepkg paczka.tgz (lub .tbz, .tlz, .txz)
.SH OPCJE
.TP 
\fB\-\-dry\-run\fP
Wyświetl wykaz plików, które zostałyby zainstalowane lub aktualizowane, ale
nie dokonuj żadnych aktualizacji.
.TP 
\fB\-\-install\-new\fP
Zwykle upgradepkg aktualizuje wyłącznie pakiety zainstalowane już na
systemie i pominie te, które nie mają zainstalowanych odpowiednikiów. Jeśli
użyto flagi \fB\-\-install\-new\fP, oprócz aktualizacji zainstalowanych już
wersji, nowe pakiety zostaną zainstalowane.
.TP 
\fB\-\-reinstall\fP
Upgradepkg zwykle pomija pakiety jeśli dokładnie taki sam pakiet
(odpowiadająca nazwa, wersja, architektura i numer) jest już zainstalowany
na systemie. Użyj opcji \-\-reinstall jeśli chcesz aktualizować wszystkie
pakiety, nawet te posiadające tę samą wersję.
.TP 
\fB\-\-verbose\fP
Wyświetl informacje o aktualizcji z wszelkimi szczegółami.
.SH BUGI
Przed aktualizacją pakietu, zapisz jakiekolwiek pliki konfiguracyjne (np. te
w /etc), które chciałbyś zachować. Czasami zostają one zachowane, ale zależy
to od struktury pakietu. Jeśli chcesz upewnić się, że nowe wersje plików
konfiguracyjnych zostaną zainstalowane, ręcznie usuń stare pliki
konfiguracyjne przed wykonaniem polecenia upgradepkg.
.SH AUTOR
Patrick J. Volkerding <volkerdi@slackware.com>
.SH "ZOBACZ RÓWNIEŻ"
\fBmakepkg(8),\fP \fBinstallpkg(8),\fP \fBremovepkg(8),\fP \fBexplodepkg(8),\fP
\fBpkgtool(8)\fP
