src/usr/share/man/nb/man8/explodepkg.8
.\" empty
.ds g 
.\" -*- nroff -*-
.\" empty
.ds G 
.de  Tp
.ie \\n(.$=0:((0\\$1)*2u>(\\n(.lu-\\n(.iu)) .TP
.el .TP "\\$1"
..
.\" Like TP, but if specified indent is more than half
.\" the current line-length - indent, use the default indent.
.\"*******************************************************************
.\"
.\" This file was generated with po4a. Translate the source file.
.\"
.\"*******************************************************************
.TH EXPLODEPKG 8 "21 Mai 1994" "Slackware Versjon 2.0.0" 
.SH NAVN
explodepkg \- Pakker ut innholdet i en tar\-komprimert pakke (f.eks en
Slackware programvare pakke) i den nåværende filkatalogen.
.SH SAMMENDRAG
\fBexplodepkg\fP \fBpakke\fP \fB[\fP \fBpakke2,\fP \fBpakke3,\fP \fB...\fP \fB]\fP
.SH BESKRIVELSE
\fBexplodepkg\fP dekomprimerer og pakker ut Slackware *.tgz (eller .tbz, .tlz,
\&.txz) pakker (eller uansett arkiv som er komprimert med en av de støttede
verktøyene) i den nåværende filkatalogen. Det er vanligvis ikke brukt for å
installere pakker siden den ikke kjører ./install eller ./var/log/setup
skriptene. \fBexplodepkg\fP er vanligvis brukt til vedlikehold av pakker \-
pakke ut innholdet til en undermappe, fikse eller oppgradere programvaren,
og deretter bygge den oppdaterte pakken med \fBmakepkg.\fP
.SH PROGRAMMERER
Patrick J. Volkerding <volkerdi@slackware.com>
.SH "SE OGSÅ"
\fBtar(1),\fP \fBgzip(1),\fP \fBinstallpkg(8),\fP \fBmakepkg(8),\fP \fBpkgtool(8),\fP
\fBupgradepkg(8)\fP
