src/usr/share/man/fr/man8/pkgtool.8
.\" empty
.ds g 
.\" -*- nroff -*-
.\" empty
.ds G 
.de  Tp
.ie \\n(.$=0:((0\\$1)*2u>(\\n(.lu-\\n(.iu)) .TP
.el .TP "\\$1"
..
.\" Like TP, but if specified indent is more than half
.\" the current line-length - indent, use the default indent.
.\"*******************************************************************
.\"
.\" This file was generated with po4a. Translate the source file.
.\"
.\"*******************************************************************
.TH PKGTOOL 8 "24 Nov 1995" "Slackware Version 3.1.0" 
.SH NOM
pkgtool \- outil de maintenance des paquets logiciels.
.SH SYNOPSIS
\fBpkgtool\fP
.LP
\fBpkgtool\fP [ \fB\-\-sets #a#b#c#\fP ] [ \fB\-\-source_mounted\fP ] [
\fB\-\-ignore_tagfiles\fP ] [ \fB\-\-tagfile tagfile\fP ] [ \fB\-\-source_dir répertoire\fP
] [ \fB\-\-target_dir répertoire\fP ] [ \fB\-\-source_device périphérique\fP ]
.SH DESCRIPTION
\fBpkgtool\fP est un outil de maintenance de paquets piloté par un menu, fourni
avec la distribution Slackware Linux. Il permet à l'utilisateur d'installer,
enlever ou voir des paquets logiciels grâce à un système interactif. pkgtool
peut aussi être utilisé pour ré\-exécuter des scripts normalement exécutés à
la fin d'une installation de Slackware grâce à un menu. C'est utile pour
effectuer une reconfiguration basique (comme changer le type de souris).
.SH OPTIONS
La plupart des utilisateurs n'auront besoin d'aucune option lors de
l'exécution de pkgtool. En général celles\-ci sont seulement utilisées quand
pkgtool est exécuté lors de l'installation initiale. Sentez\-vous libre de
vous servir de ces options, mais soyez prudent.
.TP 
\fB\-\-sets #A#B#C#\fP
Installer les séries de disquettes A, B, C. Distinguez les séries de
disquettes par le symbole '#'. 
.TP 
\fB\-\-source_mounted\fP
Quand cette option est présente, \fBpkgtool\fP ne tentera pas de démonter et de
remonter le périphérique source pour chaque disque.
.TP 
\fB\-\-ignore_tagfiles\fP
Quand cette option est présente, \fBpkgtool\fP  installe chaque paquet
rencontré, peu importe ce que dit le fichier "tagfile".
.TP 
\fB\-\-tagfile tagfile\fP
Cette option sert à spécifier dans la ligne de commande quel fichier
"tagfile" utiliser pour l'installation.
.TP 
\fB\-\-source_dir répertoire\fP
Option utilisée quand on installe de multiples paquets à partir d'un
ensemble de disques. C'est le répertoire dans lequel les sous\-répertoires
sont trouvés pour chaque disque. Ceci n'est pas utilisé dans le cas d'une
installation à partir de disquettes.
.TP 
\fB\-\-target_dir répertoire\fP
Le répertoire racine cible (chemin vers la racine du système à
installer). C'est "/" quand on installe depuis le disque dur, ou typiquement
"/mnt" quand on installe à partir d'un disque d'installation.
.TP 
\fB\-\-source_device périphérique\fP
Le périphérique source de l'installation. Cette option n'est pas utilisée
si vous fournissez le paramètre
\fB\-\-source_mounted\fP
Elle est généralement utilisée lors d'une installation à partir de
disquettes, comme dans:
 \-\-source_device /dev/fd0u1440
ou
 \-\-source_device /dev/fd1h1200.
.SH AUTEUR
Patrick J. Volkerding <volkerdi@slackware.com>
.SH "VOIR AUSSI"
\fBmakepkg(8),\fP \fBexplodepkg(8),\fP \fBinstallpkg(8),\fP \fBremovepkg(8),\fP
\fBupgradepkg(8)\fP
