src/usr/share/man/el/man8/installpkg.8
.\" empty
.ds g 
.\" -*- nroff -*-
.\" empty
.ds G 
.de  Tp
.ie \\n(.$=0:((0\\$1)*2u>(\\n(.lu-\\n(.iu)) .TP
.el .TP "\\$1"
..
.\" Like TP, but if specified indent is more than half
.\" the current line-length - indent, use the default indent.
.\"*******************************************************************
.\"
.\" This file was generated with po4a. Translate the source file.
.\"
.\"*******************************************************************
.TH INSTALLPKG 8 "22 Νοεμβρίου 2001" "Slackware Version 8.1.0" 
.SH ΟΝΟΜΑ
installpkg \- εγκατάσταση πακέτων Slackware.
.SH ΣΥΝΟΨΗ
\fBinstallpkg\fP [ \fB\-\-warn\fP ] [ \fB\-\-md5sum\fP ] [ \fB\-\-root /άλληρίζα\fP ] [
\fB\-\-infobox\fP ] [ \fB\-\-menu\fP ] [ \fB\-\-terse\fP ] [ \fB\-\-ask\fP ] [ \fB\-\-priority
ADD|REC|OPT|SKP\fP ] [ \fB\-\-tagfile /κάποιοςκατάλογος/tagfile\fP ]
\fBόνομαπακέτου\fP [ \fBόνομαπακέτου2 ...\fP ]
.SH ΠΕΡΙΓΡΑΦΗ
Το \fBinstallpkg\fP εγκαθιστά ένα ή πολλαπλά πακέτα *.tgz (or .tbz, .tlz, .txz)
τα οποία είναι σχεδιασμένα για χρήση με τη διανομή Slackware Linux στο
σύστημά σας.
.SH ΕΠΙΛΟΓΕΣ
.TP 
\fB\-\-warn όνομαπακέτου\fP
Δημιουργία μιας λίστας αρχείων που θα αντικατασταθούν στην τυπική έξοδο,
αλλά χωρίς να γίνει εγκατάσταση του πακέτου. Η λίστα είναι διαμορφωμένη ώστε
να χρησιμεύει ως λίστα αρχείων για δημιουργία αρχείων ασφαλείας.
.TP 
\fB\-\-md5sum όνομαπακέτου\fP
Καταγραφή του αθροίσματος md5 του πακέτου στα μεταδεδομένα που εγγράφονται
στο /var/log/packages.
.TP 
\fB\-\-root /άλληρίζα\fP
Εγκατάσταση χρησιμοποιώντας μια διαφορετική τοποθεσία προορισμό από το /
(εξ' ορισμού τιμή) ως το βασικό κατάλογο του συστήματος αρχείων. Στο
παράδειγμα που δίνεται, χρησιμοποιείται το /άλληρίζα στη θέση του. Θέτοντας
τη μεταβλητή περιβάλλοντος ROOT έχει το ίδιο αποτέλεσμα.
.TP 
\fB\-\-infobox\fP
Χρήση του /bin/dialog για την εμφάνιση ενός διαλόγου πληροφοριών ενώ
εγκαθίσταται το πακέτο. Χρησιμοποιείται κυρίως όταν το installpkg καλείται
από άλλα σενάρια.
.TP 
\fB\-\-menu\fP
Χρήση του /bin/dialog για την εμφάνιση ενός μενού το οποία θα ρωτά το χρήστη
αν επιθυμεί να εγκαταστήσει τα πακέτα ή όχι. Γενικά χρησιμοποιείται όταν το
installpkg καλείται από άλλα σενάρια.
.TP 
\fB\-\-terse\fP
Εγκατάσταση του πακέτου εμφανίζοντας μόνο μία γραμμή περιγραφής στην τυπική
έξοδο.
.TP 
\fB\-\-ask\fP
Χρησιμοποιείται ταυτόχρονα με την επιλογή \-\-menu. Όταν επιλέγεται, γίνεται
πάντα ερώτηση αν το πακέτο θα πρέπει να εγκατασταθεί ανεξάρτητα από την
προτεραιότητά του.
.TP 
\fB\-\-priority ADD|REC|OPT|SKP\fP
Όταν γίνεται εγκατάσταση με τη χρήση της επιλογής \-\-menu, τα επίπεδα
προτεραιότητας των πακέτων (τα οποία βρίσκονται στο αρχείο "tagfile" στον
κατάλογο των πακέτων) χρησιμοποιούνται για την αυτόματη εγκατάσταση (ADD) ή
παράλειψη (SKP) ενός πακέτου, ή για την πρόταση συνιστώμενων (REC) ή
προαιρετικών (OPT) πακέτων στο χρήστη αν εμφανίζεται ένα μενού. Αν η
προτεραιότητα έχει τεθεί στην γραμμή εντολών, θα υπερισχύσει των τιμών που
δίνονται στο αρχείο tagfile για ολόκληρη την λίστα πακέτων.
.TP 
\fB\-\-tagfile /κάποιοςκατάλογος/tagfile\fP
Καθορισμός ενός διαφορετικού αρχείου προτεραιοτήτων πακέτων (σ'αυτό το
παράδειγμα, θα χρησιμοποιηθεί το /κάποιοςκατάλογος/tagfile). To εξ' ορισμού
αρχείο ονομάζεται "tagfile" και βρίσκεται στον ίδιο κατάλογο με τα πακέτα.
.SH ΠΑΡΑΔΕΙΓΜΑΤΑ
.TP 
\fBΕγκατάσταση ενός πακέτου γραμματοσειρών για το σύστημα X:\fP
.P
installpkg font\-bh\-ttf\-1.0.3\-noarch\-1.txz
.P
Σημειώστε ότι αν ένα πακέτο είναι ήδη εγκατεστημένο, το upgradepkg(8) θα
πρέπει να χρησιμοποιηθεί αντ'αυτού.
.TP 
\fBΔημιουργία ενός αντιγράφου ασφαλείας των αρχείων που θα αντικατασταθούν αν εγκατασταθεί το πακέτο:\fP
.P
.nf
tar czvf /tmp/backup.tar.gz \e
  $(installpkg \-\-warn font\-bh\-ttf\-1.0.3\-noarch\-1.txz)
.fi
.SH ΣΥΓΓΡΑΦΕΑΣ
Patrick J. Volkerding <volkerdi@slackware.com>
.SH "ΒΛΕΠΕ ΕΠΙΣΗΣ"
\fBmakepkg(8),\fP \fBremovepkg(8),\fP \fBexplodepkg(8),\fP \fBpkgtool(8),\fP
\fBupgradepkg(8)\fP
