src/usr/share/man/el/man8/makepkg.8
.\" empty
.ds g 
.\" -*- nroff -*-
.\" empty
.ds G 
.de  Tp
.ie \\n(.$=0:((0\\$1)*2u>(\\n(.lu-\\n(.iu)) .TP
.el .TP "\\$1"
..
.\" Like TP, but if specified indent is more than half
.\" the current line-length - indent, use the default indent.
.\"*******************************************************************
.\"
.\" This file was generated with po4a. Translate the source file.
.\"
.\"*******************************************************************
.TH MAKEPKG 8 "21 Μαΐου 1994" "Slackware Version 2.0.0" 
.SH ΟΝΟΜΑ
makepkg \- δημιουργία πακέτων Slackware.
.SH ΣΥΝΟΨΗ
\fBmakepkg\fP [ \fB\-l, \-\-linkadd y|n\fP ] [ \fB\-c, \-\-chown y|n\fP ] \fBόνομαπακέτου\fP
.SH ΠΕΡΙΓΡΑΦΗ
Το \fBmakepkg\fP δημιουργεί ένα νέο πακέτο Slackware. Το πακέτο δημιουργείται
από τα περιεχόμενα του τρέχοντος καταλόγου και όλων των υποκαταλόγων του. Αν
υπάρχουν συμβολικοί δεσμοί, θα μετατραπούν σε κώδικα σεναρίων ώστε να
δημιουργηθούν ξανά όταν εγκατασταθεί το πακέτο. Ο κώδικας αυτός θα προστεθεί
στο τέλος των σεναρίων της κύριας εγκατάστασης \fB( install/doinst.sh )\fP. ή,
αν το σενάριο δεν υπάρχει ήδη, θα δημιουργηθεί με αυτά τα περιεχόμενα. Το
πακέτο θα δημιουργηθεί με το όνομα \fBόνομαπακέτου\fP το οποίο θα πρέπει να
είναι το πλήρες όνομα, συμπεριλαμβανόμενης της επέκτασης. Αυτή είναι συνήθως
\&.tgz, αλλά τα .tbz, .tlz και .txz είναι επίσης αποδεκτά. Το αντίστοιχο
εργαλείο συμπίεσης (gzip, bzip2, lzma ή xz) θα πρέπει να είναι εγκατεστημένο
στο σύστημα.
.SH ΕΠΙΛΟΓΕΣ
.TP 
\fB\-l, \-\-linkadd y|n\fP
Αν είναι y, γίνεται προσθήκη των συμβολικών δεσμών τα οποία βρίσκονται στο
σενάριο εγκατάστασης (doinst.sh) και διαγραφή τους. Αυτή είναι η συνιστώμενη
ενέργεια. Αν δεν χρησιμοποιηθεί αυτή η επιλογή, το makepkg θα εμφανίσει
προτροπή αν βρεθούν συμβολικοί δεσμοί.
.TP 
\fB\-p, \-\-prepend\fP
Αν χρησιμοποιηθεί αυτή η επιλογή, τότε όσοι συμβολικοί δεσμοί βρίσκονται στο
doinst.sh θα ενσωματωθούν στην αρχή του υπάρχοντος σεναρίου. Αυτό είναι
χρήσιμο για πακέτου που περιέχουν κοινόχρηστες βιβλιοθήκες οι οποίες θα
πρέπει πρώτα να συνδεθούν, γιατί υπάρχουν προγράμματα που θα τις
χρησιμοποιήσουν αργότερα στο σενάριο doinst.sh.
.TP 
\fB\-c, \-\-chown y|n\fP
Αν είναι y, το makepkg θα επαναφέρει όλα τα δικαιώματα των καταλόγων στο 755
και την ιδιοκτησία τους στο root:root. Γενικά, θα πρέπει να ξέρετε ήδη τα
δικαιωματά και τις ιδιοκτησίες ο ίδιος, οπότε το να βασίζεστε στο να θέτετε
αυτή την επιλογή στο y είναι κάπως πρόχειρο. Δεν είναι η εξ' ορισμού
επιλογή. Αν δεν δίνεται κάποια επιλογή, το makepkg θα εμφανίσει μια
προτροπή.
.SH "ΣΕΝΑΡΙΑ ΕΓΚΑΤΑΣΤΑΣΗΣ"
Υπάρχουν 3 είδη σεναρίων εγκατάστασης που υποστηρίζονται από το σύστημα
πακέτων του Slackware.
.TP 
Το πρώτο είναι το
\fBκύριο\fP σενάριο εγκατάστασης. Αυτό βρίσκεται στον υποκατάλογο \fB./install\fP
και πρέπει να έχει το όνομα \fBdoinst.sh\fP ώστε να αναγνωριστεί. Αυτό (και
άλλα σενάρια εγκατάστασης) πρέπει να είναι γραμμένα με τη χρήστη βασικής
σύνταξης του κελύφους Bourne, όπως αναγνωρίζεται από το κέλυφος \fBash\fP, αφού
αυτό είναι το κέλυφος που θα χρησιμοποιηθεί για την εκτέλεση των σεναρίων
κατά την εγκατάσταση του Slackware. Αυτό είναι ένα συχνό πρόβλημα \- προσοχή
στη χρήση επεκτάσεων σύνταξης του \fBbash\fP, γιατί το σενάριο θα δουλεύει
σωστά όταν τρέχει από ένα εγκατεστημένο σύστημα στο σκληρό δίσκο, αλλά θα
εμφανίσει προβλήματα κατά την εγκατάσταση. Αν το πακέτο είναι για προσωπική
χρήση, αυτό δεν είναι πρόβλημα. Αλλά δείξτε προσοχή αν θέλετε να μοιραστείτε
το πακέτο με άλλους χρήστες. Το \fBκυρίως σενάριο εγκατάστασης\fP εκτελείται
αμέσως μετά την εγκατάσταση του πακέτου με τα \fBinstallpkg, pkgtool,\fP ή
\fBsetup.\fP.
.TP 
Το δεύτερο είδος σεναρίου είναι το
σενάριο \fBρυθμίσεων\fP. Αυτό βρίσκεται στον υποκατάλογο \fB./var/log/setup\fP και
πρέπει να έχει όνομα που ξεκινά από \fBsetup.\fP ώστε να μπορεί να
αναγνωριστεί. Ένα παράδειγμα είναι το σενάριο ζώνης ώρας:
\fB/var/log/setup/setup.timeconfig.\fP Αυτά τα σενάρια εκτελούνται κατά την
φάση \fBCONFIGURE\fP της \fBεγκατάστασης,\fP και επανεκτελούνται κάθε φορά που ο
χρήστης επιλέγει τη \fBCONFIGURE\fP από της \fBεγκατάστασης\fP. Μια τυπική χρήση
είναι ο χρήστης να εκτελεί αυτή τη φάση της εγκατάστασης και να ακολουθεί η
εγκατάσταση των πακέτων. Οτιδήποτε απαιτεί διάδραση θα πρέπει να βρίσκεται
σε ένα από αυτά τα σενάρια για αποφυγή παρακώλυσης της διαδικασίας
εγκατάστασης των πακέτων κατά την \fBεγκατάσταση.\fP
.TP 
Ο τρίτος τύπος σεναρίου είναι το
σενάριο \fBμιαςφοράςμόνο\fP. Όπως είναι εμφανές από το όνομα, αυτά εκτελούνται
μόνο μία φορά όταν το πακέτο εγκαθίσταται, σε αντίθεση με τα τυπικά σενάρια
\fBεγκατάστασης\fP. Αυτά τα σενάριο βρίσκονται επίσης στον κατάλογο
\&\fB./var/log/setup\fP και το όνομά τους πρέπει να ξεκινά από \fBsetup.,\fP αλλά
επιπρόσθετα το όνομα πρέπει να περιέχει το \fBonlyonce.\fP Ένα παράδειγμα
μπορεί να είναι το σενάριο με την ονομασία
\fB/var/log/setup/setup.onlyonce.testscript\fP
.SH "ΜΟΡΦΗ ΠΑΚΕΤΩΝ"
Το \fBmakepkg\fP χρησιμοποιεί το GNU tar και το GNU gzip για τη δημιουργία των
πακέτων. Ένας απλός τρόπος για την εξαγωγή των περιεχομένων των πακέτων
(χωρίς τη χρήση των σεναρίων εγκατάσταστης φυσικά) είναι να χρησιμοποιήσετε
αυτές τις εντολές ως εξής:
.TP 
explodepkg πακέτο.tgz
.TP 
Η, κάπως έτσι:
.TP 
gzip \-dc πακέτο.tgz | tar xvvf \-
.SH ΣΥΓΓΡΑΦΕΑΣ
Patrick J. Volkerding <volkerdi@slackware.com>
.SH "ΒΛΕΠΕ ΕΠΙΣΗΣ"
\fBinstallpkg(8),\fP \fBexplodepkg(8),\fP \fBremovepkg(8),\fP \fBpkgtool(8),\fP
\fBupgradepkg(8)\fP
