src/usr/share/man/el/man8/pkgtool.8
.\" empty
.ds g 
.\" -*- nroff -*-
.\" empty
.ds G 
.de  Tp
.ie \\n(.$=0:((0\\$1)*2u>(\\n(.lu-\\n(.iu)) .TP
.el .TP "\\$1"
..
.\" Like TP, but if specified indent is more than half
.\" the current line-length - indent, use the default indent.
.\"*******************************************************************
.\"
.\" This file was generated with po4a. Translate the source file.
.\"
.\"*******************************************************************
.TH PKGTOOL 8 "24 Νοεμβρίου 1995" "Slackware Version 3.1.0" 
.SH ΟΝΟΜΑ
pkgtool \- εργαλείο διαχείρισης πακέτων λογισμικού.
.SH ΣΥΝΟΨΗ
\fBpkgtool\fP
.LP
\fBpkgtool\fP [ \fB\-\-sets #a#b#c#\fP ] [ \fB\-\-source_mounted\fP ] [
\fB\-\-ignore_tagfiles\fP ] [ \fB\-\-tagfile tagfile\fP ] [ \fB\-\-source_dir κατάλογος\fP
] [ \fB\-\-target_dir κατάλογος\fP ] [ \fB\-\-source_device συσκευή\fP ]
.SH ΠΕΡΙΓΡΑΦΗ
Το \fBpkgtool\fP είναι ένα εργαλείο διαχείρισης πακέτων που χρησιμοποιεί μενού
και διατίθεται μαζί με τη διανομή Linux Slackware. Επιτρέπει την
εγκατάσταση, αφαίρεση ή εμφάνιση των πακέτων λογισμικού μέσω ενός συστήματος
διάδρασης. Το pkgtools μπορεί επίσης να χρησιμοποιηθεί για την επανεκτέλεση
των μενού που περιλαμβάνονται στα σενάρια που εκτελούνται στο τέλος μιας
εγκατάστασης Slackware. Αυτό είναι χρήσιμο για την εκτέλεση βασικών εργασιών
παραμετροποίησης (όπως την αλλαγή του τύπου ποντικιού).
.SH ΕΠΙΛΟΓΕΣ
Οι περισσότεροι χρήστες δεν θα θελήσουν να χρησιμοποιήσουν οποιεσδήποτε
παραμέτρους όταν εκτελούν το \fBpkgtool.\fP Αυτές οι παράμετροι γενικά
χρησιμοποιούνται μόνο όταν το \fBpkgtool\fP εκτελείται κατά την αρχική
εγκατάσταση του συστήματος. Μπορείτε να δοκιμάσετε αυτές τις παραμέτρους
ελεύθερα, αλλά με προσοχή.
.TP 
\fB\-\-sets #A#B#C#\fP
Εγκατάσταση των σετ δίσκων A, B, C. Διαχωρίστε τα ονόματα των σετ με σύμβολα
\&'#'.
.TP 
\fB\-\-source_mounted\fP
Όταν έχει δωθεί η επιλογή αυτή, το \fBpkgtool\fP δεν θα προσπαθήσει να
αποπροσαρτήσει και να προσαρτήσει ξανά τη συσκευή του κάθε δίσκου.
.TP 
\fB\-\-ignore_tagfiles\fP
Όταν έχει δωθεί αυτή η επιλογή, το \fBpkgtool\fP θα εγκαταστήσει κάθε πακέτο
που που βρίσκει χωρίς να λκαμβάνει υπόψιν τα αρχεία ετικετών (tagfiles).
.TP 
\fB\-\-tagfile tagfile\fP
Η επιλογή αυτή χρησιμοποιείται για τον προσδιορισμό από τη γραμμή εντολών
του αρχείου ετικέτων (tagfile) που θα χρησιμοποιηθεί κατά την εγκατάσταση.
.TP 
\fB\-\-source_dir κατάλογος\fP
Χρησιμοποιείται κατά την εγκατάσταση πολλαπλών πακέτων από τα σετ δίσκων. Ο
κατάλογος που δίνεται ως όρισμα είναι αυτός στον οποίο περιλαμβάνονται οι
υποκατάλογοι για τον κάθε δίσκο. Δεν χρησιμοποιείται όταν γίνεται
εγκατάσταση από δισκέτες.
.TP 
\fB\-\-target_dir κατάλογος\fP
Ο κατάλογος όπου βρίσκεται ο βασικός κατάλογος στο σύστημα που γίνεται η
εγκατάσταση. Αυτός είναι ο '/' όταν γίνεται η εγκατάσταση στον σκληρό δίσκο,
ή τυπικά ο '/mnt' όταν γίνεται η εγκατάσταση από το δίσκο εγκατάστασης.
.TP 
\fB\-\-source_device συσκευή\fP
Η πηγαία συσκευή από όπου θα γίνει η εγκατάσταση. Δεν χρησιμοποιείται αν έχει προσδιοριστεί το
\fB\-\-source_mounted\fP
Συνήθως χρησιμοποιείται όταν γίνεται εγκατάσταση από δισκέτες, όπως:
\-\-source_device /dev/fd0u1440
ή
\-\-source_device /dev/fd1h1200
.SH ΣΥΓΓΡΑΦΕΑΣ
Patrick J. Volkerding <volkerdi@slackware.com>
.SH "ΒΛΕΠΕ ΕΠΙΣΗΣ"
\fBmakepkg(8),\fP \fBexplodepkg(8),\fP \fBinstallpkg(8),\fP \fBremovepkg(8),\fP
\fBupgradepkg(8)\fP
