src/usr/share/man/el/man8/removepkg.8
.\" empty
.ds g 
.\" -*- nroff -*-
.\" empty
.ds G 
.de  Tp
.ie \\n(.$=0:((0\\$1)*2u>(\\n(.lu-\\n(.iu)) .TP
.el .TP "\\$1"
..
.\" Like TP, but if specified indent is more than half
.\" the current line-length - indent, use the default indent.
.\"*******************************************************************
.\"
.\" This file was generated with po4a. Translate the source file.
.\"
.\"*******************************************************************
.TH REMOVEPKG 8 "23 Νοεμβρίου 2001" "Slackware Version 8.1.0" 
.SH ΟΝΟΜΑ
removepkg \- απεγκατάσταση πακέτων Slackware.
.SH ΣΥΝΟΨΗ
\fBremovepkg\fP \fBόνομα πακέτου\fP
.LP
[ \fBROOT=/mnt\fP ] \fBremovepkg\fP [ \fB\-copy\fP ] [ \fB\-keep\fP ] [ \fB\-preserve\fP ] [
\fB\-warn\fP ] \fBόνομα πακέτου\fP
.SH ΠΕΡΙΓΡΑΦΗ
Το \fBremovepkg\fP αφαιρεί ένα εγκατεστημένο πακέτο Slackware, ενώ εμφανίζει
μια έκθεση προόδου στην τυπική συσκευή εξόδου. Ένα πακέτο μπορεί να
προσδιοριστεί είτε με το πλήρες όνομα του πακέτου (όπως θα βλέπατε να
αναφέρεται στο /var/log/packages/), ή με το βασικό όνομα πακέτου. Για
παράδειγμα, το πακέτο foo\-1.0\-i486\-1.tgz μπορεί να απεγκατασταθεί με
οποιαδήποτε από τις ακόλουθες εντολές:

removepkg foo\-1.0\-i486\-1.tgz (δεκτά επίσης τα: .tbz, .tlz, .txz)

removepkg foo\-1.0\-i486\-1

removepkg foo.tgz

removepkg foo

Κατά τη διαγραφή αρχείων, το \fBremovepkg\fP θα αναλύσει το περιεχόμενο των
άλλων πακέτων που είναι εγκατεστημένα στο σύστημά σας, και θα διαγράψει μόνο
τα αρχεία που είναι μοναδικά για το πακέτο που αφαιρείται. Ομοίως, τα
σενάρια εγκατάστασης όλα τα άλλα πακέτα θα πρέπει να λαμβάνονται υπόψη όταν
αποφασίζεται αν πρέπει ή όχι να διαγραφούν συμβολικές συνδέσεις από το
πακέτο.
.LP
Η απεγκατάσταση ενός πακέτου (καθώς και η εγκατάσταση ενός) μπορεί να είναι
μια επικίνδυνη εργασία. Για το λόγο αυτό, υπάρχει διαθέσιμη η επλογή
\fB\-warn\fP. Όταν τη χρησιμοποιείτε, το \fBremovepkg\fP δεν θα αφαιρέσει
πραγματικά κανένα αρχείο ή τους συνδέσμους, αλλά θα εμφανίσει μια λεπτομερή
έκθεση για το τι θα συμβεί αν όντως απεγκαταστήσετε το πακέτο. Προτείνεται
να το κάνετε αυτό (και ίσως να ανακατευθύνετε την έξοδο στη \fBless\fP ) πριν
από την απεγκατάσταση πακέτων για να βεβαιωθείτε ότι έχετε δημιουργήσει
αντίγραφα ασφαλείας κάτι που θα μπορούσε να είναι σημαντικό.
.LP
Όταν αφαιρείτε ένα πακέτο, ο αρχικός δείκτης αρχείου θα μετακινηθεί από το
/var/log/packages στο /var/log/removed_packages. Ομοίως, το σχετικό σενάριο
εγκατάστασης θα μετακινηθεί από το  /var/log/scripts στο
/var/log/removed_scripts.
.SH ΕΠΙΛΟΓΕΣ
.TP 
\fB\-warn όνομα πακέτου\fP
Δημιουργεί μια έκθεση στην τυπική έξοδο για ποια αρχεία και κατάλογοι
πρόκειται να αφαιρεθούν, αλλά δεν απεγκαθίσταται στην πραγματικότητα το
πακέτο.
.TP 
\fB\-preserve όνομα πακέτου\fP
Αν καθοριστεί, το πλήρες υποδέντρο του πακέτου ανακατασκευάζεται στο
/var/log/setup/tmp/preserved_packages/όνομα_πακέτου.
.TP 
\fB\-copy όνομα πακέτου\fP
Κατασκεύασε ένα αντίγραφο του πακέτου κάτω από τον κατάλογο
/var/log/setup/tmp/preserved_packages/όνομα_πακέτου, αλλά μην το
απεγκαταστήσεις. (ίδιο αποτέλεσμα με την  \-warn \-preserve)
.TP 
\fB\-keep\fP
Αποθήκευσε τα ενδιάμεσα αρχεία που δημιουργούνται από τη removepkg
(delete_list, required_files, uniq_list, del_link_list, required_links,
required_list). Κυρίως χρήσιμο για σκοπούς εντοπισμού σφαλμάτων.
.SH " "
Είναι δυνατόν να αφαιρέσετε ένα πακέτο από ένα σύστημα αρχείων, που
βρίσκεται εκτός του / εισάγοντας στη \fBremovepkg\fP τη \fBROOT\fP μεταβλητή
περιβάλλοντος:
.TP 
\fBROOT=/mnt removepkg όνομα_πακέτου\fP

.SH ΣΥΓΓΡΑΦΕΙΣ
Patrick J. Volkerding <volkerdi@slackware.com>, με βελτιώσεις από
τον Christian Franke <c.franke@acm.org>
.SH "ΒΛΕΠΕ ΕΠΙΣΗΣ"
\fBinstallpkg(8),\fP \fBmakepkg(8),\fP \fBpkgtool(8),\fP \fBupgradepkg(8)\fP
