src/usr/share/man/el/man8/upgradepkg.8
.\" empty
.ds g 
.\" -*- nroff -*-
.\" empty
.ds G 
.de  Tp
.ie \\n(.$=0:((0\\$1)*2u>(\\n(.lu-\\n(.iu)) .TP
.el .TP "\\$1"
..
.\" Like TP, but if specified indent is more than half
.\" the current line-length - indent, use the default indent.
.\"*******************************************************************
.\"
.\" This file was generated with po4a. Translate the source file.
.\"
.\"*******************************************************************
.TH UPGRADEPKG 8 "31 Mαΐου 2002" "Slackware Version 8.1.0" 
.SH ΟΝΟΜΑ
upgradepkg \- αναβάθμιση πακέτων Slackware.
.SH ΣΥΝΟΨΗ
\fBupgradepkg\fP [ \fB\-\-dry\-run\fP ] [ \fB\-\-install\-new\fP ] [ \fB\-\-reinstall\fP ] [
\fB\-\-verbose\fP ] \fBνέοόνομαπακέτου\fP \fB[\fP\fIνέοόνομαπακέτου2\fP\fB]\fP
.LP
\fBupgradepkg\fP [ \fB\-\-dry\-run\fP ] [ \fB\-\-install\-new\fP ] [ \fB\-\-reinstall\fP ] [
\fB\-\-verbose\fP ] \fBπαλαιόόνομαπακέτου%νέοόνομαπακέτου\fP \fB[\fP\fIπαλαιό2%νέο2\fP\fB]\fP
.SH ΠΕΡΙΓΡΑΦΗ
Το \fBupgradepkg\fP αναβαθμίζει ένα Slackware πακέτο παλαιότερης έκδοσης σε ένα
νεότερο. Αυτό επιτυγχάνεται με την \fBΕΓΚΑΤΑΣΤΑΣΗ\fP του νέου πακέτου στο
σύστημα, και την \fBΑΠΕΓΚΑΤΑΣΤΑΣΗ\fP στη συνέχεια όλων των αρχείων από το παλιό
πακέτο που δεν είναι στο νέο πακέτο. Αν τα παλαιά και τα νέα πακέτα έχουν το
ίδιο όνομα, μια μόνο παράμετρος είναι το μόνο που απαιτείται. Αν τα πακέτα
έχουν διαφορετικά ονόματα, γράψτε το όνομα του παλιού πακέτου ακολουθούμενο
από το σύμβολο του ποσοστού (%), και κατόπιν το όνομα του νέου πακέτου. Μην
προσθέτετε κανένα επιπλέον κενό μεταξύ των ζευγών των παλαιών/νέων ονομάτων
πακέτου.

Αν η upgradepkg βρίσκει περισσότερα από ένα εγκατεστημένα πακέτα που
ταιριάζουν με το όνομα του παλιού πακέτου, θα τα αφαιρέσει όλα.
.TP 
Για να αναβαθμίσετε σε έναν κατάλογο, διαφορετικό από τον / (όπως το /mnt):
.TP 
ROOT=/mnt upgradepkg πακέτο.tgz (ή .tbz, .tlz, .txz)
.SH ΕΠΙΛΟΓΕΣ
.TP 
\fB\-\-dry\-run\fP
Εξάγει μια έκθεση σχετικά με το ποια πακέτα θα εγκατασταθούν ή θα
αναβαθμιστούν, αλλά δεν εκτελεί πράγματι τις αναβαθμίσεις.
.TP 
\fB\-\-install\-new\fP
Κανονικά το upgradepkg αναβαθμίζει μόνο τα πακέτα  που είναι ήδη
εγκατεστημένα στο σύστημα, και θα παρακάμψει οποιαδήποτε τυχόν πακέτα για τα
οποία δεν υπάρχει ήδη εγκατεστημένη μια έκδοση τους. Αν προστεθεί η
\fB\-\-install\-new\fP, η συμπεριφορά του τροποποιείται για να εγκαταστήσει νέα
πακέτα αλλά και κάνει την αναβάθμιση των υπαρχόντων.
.TP 
\fB\-\-reinstall\fP
Το upgradepkg συνήθως παραβλέπει τα πακέτα εάν το ίδιο ακριβώς πακέτο (με το
ίδιο όνομα, έκδοση, αρχιτεκτονική, και αριθμό μεταγλώτισσης) είναι ήδη
εγκατεστημένο στο σύστημα. Χρησιμοποιήστε την επιλογή \-\-reinstall αν θέλετε
να αναβαθμίσετε όλα τα πακέτα, ακόμη και αν η ίδια έκδοση είναι ήδη
εγκατεστημένη.
.TP 
\fB\-\-verbose\fP
Εμφάνισε όλες τις φρικιαστικές λεπτομέρειες της αναβάθμισης.
.SH BUGS
Πριν από την αναβάθμιση ενός πακέτου, αποθηκεύσετε οποιαδήποτε αρχεία
ρυθμίσεων (όπως αυτά στο /etc) που θέλετε να κρατήσετε. Μερικές φορές, αυτά
θα πρέπει να διατηρηθούν, αλλά αυτό εξαρτάται από τη δομή του πακέτου. Αν
θέλετε να επιβάλετε νέες εκδόσεις των αρχείων ρυθμίσεων που πρόκειται να
εγκατασταθούν, αφαιρέστε τα παλιά με το χέρι πριν από την εκτέλεση της
upgradepkg.
.SH ΣΥΓΓΡΑΦΕΑΣ
Patrick J. Volkerding <volkerdi@slackware.com>
.SH "ΒΛΕΠΕ ΕΠΙΣΗΣ"
\fBmakepkg(8),\fP \fBinstallpkg(8),\fP \fBremovepkg(8),\fP \fBexplodepkg(8),\fP
\fBpkgtool(8)\fP
