src/usr/share/man/uk/man8/installpkg.8
.\" empty
.ds g 
.\" -*- nroff -*-
.\" empty
.ds G 
.de  Tp
.ie \\n(.$=0:((0\\$1)*2u>(\\n(.lu-\\n(.iu)) .TP
.el .TP "\\$1"
..
.\" Like TP, but if specified indent is more than half
.\" the current line-length - indent, use the default indent.
.\"*******************************************************************
.\"
.\" This file was generated with po4a. Translate the source file.
.\"
.\"*******************************************************************
.TH INSTALLPKG 8 "22 Листопада 2001" "Slackware версія 8.1.0" 
.SH ІМ'Я
installpkg \- встановлює пакунки Slackware.
.SH Перегляд
\fBinstallpkg\fP [ \fB\-\-warn\fP ] [ \fB\-\-md5sum\fP ] [ \fB\-\-root /otherroot\fP ] [
\fB\-\-infobox\fP ] [ \fB\-\-menu\fP ] [ \fB\-\-terse\fP ] [ \fB\-\-ask\fP ] [ \fB\-\-priority
ADD|REC|OPT|SKP\fP ] [ \fB\-\-tagfile /somedir/tagfile\fP ] \fBpackagename\fP [
\fBpackagename2 ...\fP ]
.SH ОПИС
\fBinstallpkg\fP встановлює один або декілька *.tgz (або .tbz, .tlz, .txz)
двійкових пакунків, зроблених для використання у дистрибутиві Slackware
Linux на вашій системі.
.SH ПАРАМЕТРИ
.TP 
\fB\-\-warn packagename\fP
Зґенерувати список файлів, які можуть бути перезаписані, й вивести його на
стандартний вивід, але у дійсності не інсталювати пакунок.\n Список
формується придатним для використання у якості списку файлів для резервного
копіювання.
.TP 
\fB\-\-md5sum packagename\fP
Записати контрольну суму md5 пакунку у метадані, що записуються у
/var/log/packages.
.TP 
\fB\-\-root /otherroot\fP
Встановити, використовуючи місцезнаходження що відрізняється від / (типово)
як корінь файлової системи для інсталяції.\n Наприклад, використовувати
/otherroot замість цього.\n Встановлення змінної оточення ROOT робить те
саме.
.TP 
\fB\-\-infobox\fP
Використовувати /bin/dialog для показу інформаційного діалогу при
встановленні пакунку.\n У основному використовується, коли installpkg
викликається з інших сценаріїв.
.TP 
\fB\-\-menu\fP
Використовувати /bin/dialog для показу меню, питаючого користувача, бажає
він встановити пакунок(и), чи ні.\n У основному використовується, коли
installpkg викликається з інших сценаріїв.
.TP 
\fB\-\-terse\fP
Інсталювати пакунок, при цьому показуючи лише один рядок опису на
стандартний вивід.
.TP 
\fB\-\-ask\fP
Використовується разом з режимом \-menu.\n Коли вказано, завжди питати, якщо
пакунок повинен бути встановлений, незалежно від його пріоритета.
.TP 
\fB\-\-priority ADD|REC|OPT|SKP\fP
При інсталяції з параметром \-\-menu рівні пріоритету пакунку (що знаходяться
у файлі tagfile у каталозі з пакунками) використовуються, щоб автоматично
встановити (ADD) або пропустити (SKP) пакунок, або запитати у користувача
рекомендований (REC) або необов’язковий (OPT), якщо меню показується.\n
Якщо пріоритет задано з командного рядка, тоді значення, задані у тегфайлі,
будуть перевизначені для цього списку пакунків.
.TP 
\fB\-\-tagfile /somedir/tagfile\fP
Вказати нестандартний файл для використання пріоритетів пакунку (у цьому
прикладі буде використовуватися /somedir/tagfile).\n Типово це "tagfile" у
каталозі з пакунками.
.SH ПРИКЛАДИ
.TP 
\fBВстановити пакунок шрифту для X:\fP
.P
installpkg font\-bh\-ttf\-1.0.3\-noarch\-1.txz
.P
Зауважте, якщо пакунок вже встановлено, тоді замість \fBinstallpkg\fP потрібно
використовувати \fBupgradepkg(8)\fP
.TP 
\fBЗробити резервну копію файлів, які можуть бути перезаписані, якщо пакунок встановлено:\fP
.P
.nf
tar czvf /tmp/backup.tar.gz $(installpkg \-\-warn font\-bh\-ttf\-1.0.3\-noarch\-1.txz)
.fi
.SH АВТОР
Patrick J. Volkerding <volkerdi@slackware.com>
.SH "ДИВИСЬ ТАКОЖ"
\fBmakepkg(8),\fP \fBremovepkg(8),\fP \fBexplodepkg(8),\fP \fBpkgtool(8),\fP
\fBupgradepkg(8)\fP
