src/usr/share/man/uk/man8/makepkg.8
.\" empty
.ds g 
.\" -*- nroff -*-
.\" empty
.ds G 
.de  Tp
.ie \\n(.$=0:((0\\$1)*2u>(\\n(.lu-\\n(.iu)) .TP
.el .TP "\\$1"
..
.\" Like TP, but if specified indent is more than half
.\" the current line-length - indent, use the default indent.
.\"*******************************************************************
.\"
.\" This file was generated with po4a. Translate the source file.
.\"
.\"*******************************************************************
.TH MAKEPKG 8 "21 травня 1994" "Версія Slackware 2.0.0" 
.SH ІМ'Я
makepkg \- створює пакунки Slackware.
.SH Перегляд
\fBmakepkg\fP [ \fB\-l, \-\-linkadd y|n\fP ] [ \fB\-c, \-\-chown y|n\fP ] \fBpackagename\fP
.SH ОПИС
\fBmakepkg\fP створює новий Slackware\-сумісний пакунок.\n Пакунок конструюється
з використанням вмісту поточного каталогу й усіх підкаталогів. Якщо існують
символічні посилання, вони будуть перетворені у код сценарію,
перестворюючого їх при встановлені пакунку. Цей код буде додано у основний
сценарій інсталяції \fB( install/doinst.sh )\fP, або, якщо цей сценарій не
існує, він буде створений з цим вмістом.\n Пакунок буде збережено у файл
\fBpackagename\fP, який повинен мати повне ім’я, включаючи розширення.\n Воно
типово .tgz, але .tbz, .tlz та .txz також можуть застосовуватися.\n
Відповідні утиліти стиснення (gzip, bzip2, lzma або xz) потрібно встановити
на комп’ютер.
.SH ПАРАМЕТРИ
.TP 
\fB\-l, \-\-linkadd y|n\fP
Якщо y, додавати будь\-які виявлені символічні посилання у сценарій
інсталяції (doinst.sh) та вилучати їх.
Це рекомендована дія.
Якщо цей параметр не використовується, \fBmakepkg\fP буде видавати запит, якщо
символічні посилання знайдено.
.TP 
\fB\-p, \-\-prepend\fP
Якщо вказано цей параметр, будь\-які символічні посилання будуть додані у
існуючий сценарій doinst.sh.
 Це корисно для пакунків, що містять розділювані бібліотеки, які повинні
бути зв’язані у сценарій doinst.sh, перш ніж програми зможуть їх
використовувати.
.TP 
\fB\-c, \-\-chown y|n\fP
Якщо y, \fBmakepkg\fP буде скидувати права доступу до каталогів на 755 та
власників на root:root.
 Зазвичай в вас мають бути правильні  права та власники, тому встановлювати
цей параметр в y трохи неохайно.
 Це не типово. Якщо цей параметр не вказано, \fBmakepkg\fP буде питати.
.SH "СЦЕНАРІЇ ІНСТАЛЯЦІЇ"
Є 3 типи сценаріїв інсталяції, що підтримуються пакунковою системою
Slackware.
.TP 
Перший \- це
\fBосновний сценарій інсталяції\fP. Він знаходиться у підкаталозі \fB./install\fP
й повинен мати ім’я \fBdoinst.sh\fP, щоб бути розпізнаним. Цей (та інші
сценарії інсталяції) повинні бути написані з використаннямм базового
синтаксису оболонки Bourne, що розпізнається оболонкою \fBash\fP, оскільки це
оболонка, яка буде виконувати сценарій при встановленні зі встановлювальної
дискети Slackware. Це звичайна пастка \- стережіться використання розширень
синтаксису \fBbash\fP,тому що при інсталяції з жорсткого диску сценарій буде
працювати правильно, але буде бомбардувати при інсталяції з дискети. Якщо
пакунок для персонального використання, це не є проблемою.  Будьте обережні,
якщо ви плануєте поділитися своїм пакунком з іншими
користувачами. \fBосновний сценарій інсталяції\fP виконується негайно після
встановлення пакунку за допомогою \fBinstallpkg, pkgtool,\fP або \fBsetup.\fP
.TP 
Другий тип сценарію \- це
\fBконфігураційний\fP сценарій. Він знаходиться у підкаталозі
\&\fB./var/log/setup\fP й повинен мати ім’я, що починається з \fBsetup.\fP, щоб бути
розпізнаним. Наприклад, сценарій timezone:
\fB/var/log/setup/setup.timeconfig.\fP Ці сценарії виконуються після фази
\fBCONFIGURE\fP у \fBsetup\fP й повторно виконуються кожного разу, коли користувач
обирає пункт \fBCONFIGURE\fP у \fBsetup\fP.
.TP 
Третій тип сценаріїв \- це
\fBодноразовий\fP сценарій. Як підказує ім’я, він виконується лише один раз
після встановлення пакунку на відміну від стандартного \fBконфігураційного\fP
сценарію. Ці сценарії також знаходяться у каталозі \fB./var/log/setup\fP й
повинні мати ім’я, яке починається з \fBsetup.,\fP, але додатково ім’я повинно
містити рядок \fBonlyonce.\fP Наприклад, може бути сценарій з іменем
\fB/var/log/setup/setup.onlyonce.testscript\fP.
.SH "ФОРМАТ ПАКУНКУ"
\fBmakepkg\fP використовує GNU tar плюс GNU gzip для створення
пакунків. Простий спосіб витягування вмісту пакунку (очевидно, без виконання
встановлювальних сценаріїв) \- це використання такої команди як:
.TP 
explodepkg package.tgz
.TP 
Або щось наподобі
.TP 
gzip \-dc package.tgz | tar xvvf \-
.SH АВТОР
Patrick J. Volkerding <volkerdi@slackware.com>
.SH "ДИВИСЬ ТАКОЖ"
\fBinstallpkg(8),\fP \fBexplodepkg(8),\fP \fBremovepkg(8),\fP \fBpkgtool(8),\fP
\fBupgradepkg(8)\fP
