src/usr/share/man/uk/man8/pkgtool.8
.\" empty
.ds g 
.\" -*- nroff -*-
.\" empty
.ds G 
.de  Tp
.ie \\n(.$=0:((0\\$1)*2u>(\\n(.lu-\\n(.iu)) .TP
.el .TP "\\$1"
..
.\" Like TP, but if specified indent is more than half
.\" the current line-length - indent, use the default indent.
.\"*******************************************************************
.\"
.\" This file was generated with po4a. Translate the source file.
.\"
.\"*******************************************************************
.TH PKGTOOL 8 "24 Листопада 1995" "Slackware Версія 3.1.0" 
.SH ІМ'Я
\fBpkgtool\fP \- інструмент обслуговування пакунків програмного забезпечення.
.SH Перегляд
\fBpkgtool\fP
.LP
\fBpkgtool\fP [ \fB\-\-sets #a#b#c#\fP ] [ \fB\-\-source_mounted\fP ] [
\fB\-\-ignore_tagfiles\fP ] [ \fB\-\-tagfile tagfile\fP ] [ \fB\-\-source_dir directory\fP
] [ \fB\-\-target_dir directory\fP ] [ \fB\-\-source_device device\fP ]
.SH ОПИС
\fBpkgtool\fP \- це меню\-орієнтований інструмент керування пакунками, що
постачається з дистрибутивом Slackware Linux. Він дозволяє користувачу
встановлювати, вилучати або переглядати пакунки програмного забезпечення
через інтерактивну систему. \fBPkgtool\fP також може бути використано для
повторного виконання меню\-орієнтованих сценаріїв, що нормально виконуються у
кінці інсталяції Slackware. Це корисно для виконання базового
переналаштування (подібного змінюванню типу миші).
.SH ПАРАМЕТРИ
Більшості користувачів не потрібно використовувати будь\-які параметри при
запуску \fBpkgtool.\fP Вони у основному використовуються лише коли \fBpkgtool\fP
запущений при початковій інсталяції системи. Не соромтеся випробовувати їх,
але будьте обережні.
.TP 
\fB\-\-sets #A#B#C#\fP
Встановити диски наборів A, B, C. Розділення набору дисків символами «#».
.TP 
\fB\-\-source_mounted\fP
Коли цей прапорець присутній, \fBpkgtool\fP не буде намагатися розмонтувати та
перемонтувати пристрій\-джерело кожного диску.
.TP 
\fB\-\-ignore_tagfiles\fP
Коли цей прапорець присутній, \fBpkgtool\fP буде встановлювати кожен пакунок,
що зустрівся у тегфайлах, не звертаючи уваги на те, що говориться у них.
.TP 
\fB\-\-tagfile tagfile\fP
Цей прапорець використовується для вказування з командного рядка, який
тегфайл повинен бути використаний для інсталяції.
.TP 
\fB\-\-source_dir directory\fP
Використовується при встановленні декількох пакунків з наборів дисків. Це
каталог, у якому знаходяться підкаталоги для кожного диску. Цей параметр не
використовується при встановленні з дискет.
.TP 
\fB\-\-target_dir directory\fP
Каталог, у якому розміщується цільовий кореневий каталог. Це «/» при
встановленні на жорсткий диск, або, зазвичай, «/mnt» при встановленні зі
встановлювального диску.
.TP 
\fB\-\-source_device device\fP
Пристрій\-джерело для інсталяції. Цей параметр не використовується, якщо ви вказали параметр
 \fB\-\-source_mounted.\fP
 Це зазвичай використовується для встановлення з дискет, як:
 \-\-source_device /dev/fd0u1440
 або
 \-\-source_device /dev/fd1h1200.
.SH АВТОР
Patrick J. Volkerding <volkerdi@slackware.com>
.SH "ДИВИСЬ ТАКОЖ"
\fBmakepkg(8),\fP \fBexplodepkg(8),\fP \fBinstallpkg(8),\fP \fBremovepkg(8),\fP
\fBupgradepkg(8)\fP
