src/usr/share/man/uk/man8/upgradepkg.8
.\" empty
.ds g 
.\" -*- nroff -*-
.\" empty
.ds G 
.de  Tp
.ie \\n(.$=0:((0\\$1)*2u>(\\n(.lu-\\n(.iu)) .TP
.el .TP "\\$1"
..
.\" Like TP, but if specified indent is more than half
.\" the current line-length - indent, use the default indent.
.\"*******************************************************************
.\"
.\" This file was generated with po4a. Translate the source file.
.\"
.\"*******************************************************************
.TH UPGRADEPKG 8 "31 Травня 2002" "Slackware версія 8.1.0" 
.SH ІМ'Я
\fBupgradepkg\fP \- оновлює пакунки Slackware.
.SH Перегляд
\fBupgradepkg\fP [ \fB\-\-dry\-run\fP ] [ \fB\-\-install\-new\fP ] [ \fB\-\-reinstall\fP ] [
\fB\-\-verbose\fP ] \fBnewpackagename\fP \fB [\fP\fInewpackagename2\fP\fB]\fP
.LP
\fBupgradepkg\fP [ \fB\-\-dry\-run\fP ] [ \fB\-\-install\-new\fP ] [ \fB\-\-reinstall\fP ] [
\fB\-\-verbose\fP ] \fBoldpackagename%newpackagenam \fP \fB [\fP\fIold2%new2\fP\fB]\fP
.SH ОПИС
\fBupgradepkg\fP оновлює пакунки Slackware зі старої версії на нову.
 Це робиться \fBІНСТАЛЯЦІЄЮ\fP нового пакунку у систему, а потім \fBВИЛУЧЕННЯМ\fP
будь\-яких файлів від старого пакунку, яких немає у новому пакунку.
 Якщо старий та новий пакунки мають таке ж ім’я, тоді один аргумент \- це
все, що потрібно.
 Якщо пакунки мають різні імена, тоді поставте ім’я старого пакунку,
наступний знак відсотку (%), потім ім’я нового пакунку.
 Не додавайте між парами імен старих/нових пакунків додаткові  пробіли.

Якщо \fBupgradepkg\fP знаходить більше ніж один встановлений пакунок, що
збігається з іменем старого пакунку, він вилучить їх усі.
.TP 
Для оновлення у каталозі, що відрізняється від / (таким як /mnt):
.TP 
ROOT=/mnt upgradepkg package.tgz (or .tbz, .tlz, .txz)
.SH ПАРАМЕТРИ
.TP 
\fB\-\-dry\-run\fP
Виводить звіт про те, які пакунки буде встановлено чи оновлено, але у
дійсності не виконує оновлення.
.TP 
\fB\-\-install\-new\fP
Нормально \fBupgradepkg\fP лише оновлює вже встановлені у систему пакунки й
пропускає будь\-які пакунки, що не мають встановленої версії.
 Якщо вказано \fB\-\-install\-new\fP, поведінка змінюється \-\- на додаток до
оновлення існуючих пакунків будуть встановлюватися нові.
.TP 
\fB\-\-reinstall\fP
\fBupgradepkg\fP зазвичай пропускає пакунки, якщо точно такий самий пакунок
(збігаються ім’я, версія, архітектура та номер збірки) вже встановлений у
системі.
 Використовуйте параметр \fBreinstall\fP, якщо ви бажаєте оновити усі пакунки,
навіть якщо така ж версія вже встановлена.
.TP 
\fB\-\-verbose\fP
Показувати усі криваві подробиці оновлення.
.SH ПОМИЛКИ
Перед оновленням пакунку збережіть усі конфігураційні файли (такі як у /etc)

, які ви би бажали зберегти.
 Інколи вони будуть зберігатися, але це залежить від структури пакунку.
 Якщо ви бажаєте, щоб були встановлені нові версії конфігураційних файлів,
вилучіть вручну старі перед запуском \fBupgradepkg\fP.
.SH АВТОР
Patrick J. Volkerding <volkerdi@slackware.com>
.SH "ДИВИСЬ ТАКОЖ"
\fBmakepkg(8),\fP \fBinstallpkg(8),\fP \fBremovepkg(8),\fP \fBexplodepkg(8),\fP
\fBpkgtool(8)\fP
