src/usr/share/man/ru/man8/explodepkg.8
.\" empty
.ds g 
.\" -*- nroff -*-
.\" empty
.ds G 
.de  Tp
.ie \\n(.$=0:((0\\$1)*2u>(\\n(.lu-\\n(.iu)) .TP
.el .TP "\\$1"
..
.\" Like TP, but if specified indent is more than half
.\" the current line-length - indent, use the default indent.
.\"*******************************************************************
.\"
.\" This file was generated with po4a. Translate the source file.
.\"
.\"*******************************************************************
.TH EXPLODEPKG 8 "21 мая 1994" "Slackware версия 2.0.0" 
.SH НАЗВАНИЕ
explodepkg \- извлекает в текущий каталог содержимое пакета tar+сжатие
(например, программный пакет Slackware).
.SH СИНТАКСИС
\fBexplodepkg\fP \fBпакет\fP \fB[\fP \fBпакет2,\fP \fBпакет3,\fP \fB...\fP \fB]\fP
.SH ОПИСАНИЕ
\fBexplodepkg\fP распаковывает пакеты Slackware  *.tgz (или .tbz, .tlz, .txz, а
также архивы, созданные сжатием архива tar одной из поддерживаемых утилит) в
текущий каталог. При этом установочные сценарии в ./install или
\&./var/log/setup не выполняются, поэтому \fBexplodepkg\fP обычно не используется
для установки пакетов. Основное назначение \fBexplodepkg\fP в обслуживании
пакетов \- извлечение пакета в подкаталог, внесение исправлений или
обновление программного обеспечения, последующая сборка обновлённого пакета
при помощи \fBmakepkg\fP.
.SH АВТОР
Patrick J. Volkerding <volkerdi@slackware.com>
.SH "СМОТРИТЕ ТАКЖЕ"
\fBtar(1),\fP \fBgzip(1),\fP \fBinstallpkg(8),\fP \fBmakepkg(8),\fP \fBpkgtool(8),\fP
\fBupgradepkg(8)\fP
