src/usr/share/man/ru/man8/installpkg.8
.\" empty
.ds g 
.\" -*- nroff -*-
.\" empty
.ds G 
.de  Tp
.ie \\n(.$=0:((0\\$1)*2u>(\\n(.lu-\\n(.iu)) .TP
.el .TP "\\$1"
..
.\" Like TP, but if specified indent is more than half
.\" the current line-length - indent, use the default indent.
.\"*******************************************************************
.\"
.\" This file was generated with po4a. Translate the source file.
.\"
.\"*******************************************************************
.TH INSTALLPKG 8 "22 ноября 2001" "Slackware версия 8.1.0" 
.SH НАЗВАНИЕ
installpkg \- устанавливает пакеты Slackware.
.SH СИНТАКСИС
\fBinstallpkg\fP [ \fB\-\-warn\fP ] [ \fB\-\-md5sum\fP ] [ \fB\-\-root /другой_корень\fP ] [
\fB\-\-infobox\fP  ] [ \fB\-\-menu\fP ] [ \fB\-\-terse\fP ] [ \fB\-\-ask\fP ] [ \fB\-\-priority
ADD|REC|OPT|SKP\fP ] [ \fB\-\-tagfile /каталог/тегфайл\fP ] \fBимя_пакета\fP
[\fBимя_пакета_2 ...\fP ]
.SH ОПИСАНИЕ
\fBinstallpkg\fP устанавливает в систему один или несколько бинарных пакетов
*.tgz (или .tbz, .tlz, .txz), предназначенных для использования в
дистрибутиве Slackware Linux.
.SH ПАРАМЕТРЫ
.TP 
\fB\-\-warn имя_пакета\fP
Сформировать и вывести на стандартный вывод список файлов, которые могут
быть перезаписаны, но саму установку не выполнять. Формат списка подходит
для использования в качестве списка файлов для резервного копирования.
.TP 
\fB\-\-md5sum имя_пакета\fP
Записать контрольную сумму md5 пакета в метаданные в /var/log/packages.
.TP 
\fB\-\-root /другой_корень\fP
Использовать при установке отличное от / (по умолчанию) местоположение корня
файловой системы. В приведённом примере вместо / будет использован
/другой_корень. Установка переменой окружения ROOT делает то же самое.
.TP 
\fB\-\-infobox\fP
Выводить при установке пакета окно информации с помощью /bin/dialog. В
основном используется при вызове installpkg из других сценариев.
.TP 
\fB\-\-menu\fP
Запрашивать решение пользователя об установке или отклонении пакета при
помощи /bin/dialog. Обычно используется при вызове installpkg из других
сценариев.
.TP 
\fB\-\-terse\fP
Выводить при установке пакета только однострочное описание.
.TP 
\fB\-\-ask\fP
Используется совместно с \-\-menu. Указывает запрашивать установку пакета вне
зависимости от его приоритета.
.TP 
\fB\-\-priority ADD|REC|OPT|SKP\fP
При установке с параметром \-\-menu приоритеты пакетов (из файла "tagfile" в
каталоге с пакетами) используются для установки (ADD) либо пропуска (SKP)
пакетов автоматически, а также для запроса у пользователя решения об
установке для рекомендуемых (REC) и необязательных (OPT) пакетов посредством
меню. Приоритет, заданный в командной строке, перекрывает приоритеты из
тегфайла для всего списка пакетов.
.TP 
\fB\-\-tagfile /каталог/тегфайл\fP
Использовать заданный файл приоритетов пакетов (в примере это
/каталог/тегфайл). По умолчанию используется "tagfile" из каталога с
пакетами.
.SH ПРИМЕРЫ
.TP 
\fBУстановка пакета шрифта для X:\fP
.P
installpkg font\-bh\-ttf\-1.0.3\-noarch\-1.txz
.P
Примечание: если пакет уже установлен, вместо \fBinstallpkg\fP необходимо
использовать \fBupgradepkg(8)\fP.
.TP 
\fBСоздание резервной копии файлов, перезаписываемых при установке пакета:\fP
.P
.nf
tar czvf /tmp/backup.tar.gz \e
  $(installpkg \-\-warn font\-bh\-ttf\-1.0.3\-noarch\-1.txz)
.fi
.SH АВТОР
Patrick J. Volkerding <volkerdi@slackware.com>
.SH "СМОТРИТЕ ТАКЖЕ"
\fBmakepkg(8),\fP \fBremovepkg(8),\fP \fBexplodepkg(8),\fP \fBpkgtool(8),\fP
\fBupgradepkg(8)\fP
