src/usr/share/man/ru/man8/makepkg.8
.\" empty
.ds g 
.\" -*- nroff -*-
.\" empty
.ds G 
.de  Tp
.ie \\n(.$=0:((0\\$1)*2u>(\\n(.lu-\\n(.iu)) .TP
.el .TP "\\$1"
..
.\" Like TP, but if specified indent is more than half
.\" the current line-length - indent, use the default indent.
.\"*******************************************************************
.\"
.\" This file was generated with po4a. Translate the source file.
.\"
.\"*******************************************************************
.TH MAKEPKG 8 "21 мая 1994" "Slackware версия 2.0.0" 
.SH НАЗВАНИЕ
makepkg \- создаёт пакеты Slackware.
.SH СИНТАКСИС
\fBmakepkg\fP [ \fB\-l, \-\-linkadd y|n\fP ] [ \fB\-c, \-\-chown y|n\fP ] \fBимя_пакета\fP
.SH ОПИСАНИЕ
\fBmakepkg\fP создаёт совместимый со Slackware новый пакет. В пакет войдёт
содержимое текущего каталога и всех подкаталогов. Имеющиеся символические
ссылки будут преобразованы в код оболочки, восстанавливающий их при
установке пакета. Этот код будет добавлен в основной установочный сценарий
(\fBinstall/doinst.sh\fP) или станет его кодом, если сценария не было.  Пакет
будет сохранен в файл \fBимя_пакета\fP, имя должно быть полным, включая
расширение (обычно .tgz, но также допустимы .tbz, .tlz и .txz). Утилиты
сжатия (gzip, bzip2, lzma или xz соответственно) должны быть установлены на
машине.
.SH ПАРАМЕТРЫ
.TP 
\fB\-l, \-\-linkadd y|n\fP
Если y, добавить создание всех символические ссылок в установочный сценарий
(doinst.sh) и удалить их. Это рекомендованное действие. Если параметр не
задан, \fBmakepkg\fP при обнаружении символических ссылок выдаст
соответствующий запрос.
.TP 
\fB\-p, \-\-prepend\fP
Добавлять создание символических ссылок в начало установочного сценария
doinst.sh.  Полезно для пакетов, в которых из doinst.sh вызываются
программы, требующие связи с содержащимися в этом же пакете разделяемыми
библиотеками.
.TP 
\fB\-c, \-\-chown y|n\fP
Если y, \fBmakepkg\fP установит каталогам разрешения в 755, владение в
root:root. Вообще, установка правильных разрешений и владения является вашей
обязанностью, так что полагаться на установку этого параметра в "y"
несколько небрежно. Умолчание отсутствует. Если параметр не указан,
\fBmakepkg\fP выдаст соответствующий запрос.
.SH "УСТАНОВОЧНЫЕ СЦЕНАРИИ"
Пакетная система Slackware поддерживает 3 типа установочных сценариев.
.TP 
Первый \- это
\fBосновной\fP установочный сценарий. Это сценарий в подкаталоге \fB./install\fP с
именем \fBdoinst.sh\fP и никакой другой. В этом и других установочных сценариях
должен использоваться только базовый синтаксис оболочки Борна (Bourne
shell), распознаваемый \fBash\fP, поскольку именно эта оболочка будет исполнять
сценарии при установке с дистрибутивного носителя Slackware. Это
распространённая ловушка \- избегайте синтаксических расширений \fBbash\fP,
иначе сценарий при установке с жесткого диска будет работать правильно, но
развалится при установке дистрибутива. Не велика беда, если пакет только для
себя. Однако, будьте аккуратны, если планируете поделиться своим пакетом с
другими пользователями. \fBОсновной установочный сценарий\fP исполняется сразу
после установки пакета с помощью \fBinstallpkg\fP, \fBpkgtool\fP, или \fBsetup\fP.
.TP 
Второй тип сценария \- это
\fBнастроечный\fP сценарий. Это сценарий в подкаталоге \fB./var/log/setup\fP с
именем, начинающимся с \fBsetup\fP. Например, сценарий timezone:
\fB/var/log/setup/setup.timeconfig\fP. Эти сценарии исполняются на шаге
\fBCONFIGURE\fP установщика \fBsetup\fP и исполняются каждый раз, когда
пользователь выбирает в нём пункт \fBCONFIGURE\fP. Этот шаг обычно выполняется,
когда установка всех пакетов уже завершена. Всё, что является интерактивным,
должно включаться в настроечные сценарии, чтобы не прерывать установку
пакетов при выполнении \fBsetup\fP.
.TP 
Третий тип сценариев \- это
\fBоднократный\fP сценарий. Как подсказывает имя, он исполняется только один
раз после установки пакета в отличие от обычного \fBнастроечного\fP
сценария. Эти сценарии также находятся в подкаталоге \fB./var/log/setup\fP и
должны иметь имя, начинающееся с \fBsetup.\fP и содержащее строку
\fBonlyonce\fP. Примером может быть сценарий с именем
\fB/var/log/setup/setup.onlyonce.testscript\fP.
.SH "ФОРМАТ ПАКЕТА"
\fBmakepkg\fP использует GNU tar плюс GNU gzip для создания пакетов. Простой
способ извлечь содержимое пакета (естественно, без выполнения установочных
сценариев) \- это использование команды:
.TP 
explodepkg пакет.tgz
.TP 
Или что\-то вроде
.TP 
gzip \-dc пакет.tgz | tar xvvf \-
.SH АВТОР
Patrick J. Volkerding <volkerdi@slackware.com>
.SH "СМОТРИТЕ ТАКЖЕ"
\fBinstallpkg(8),\fP \fBexplodepkg(8),\fP \fBremovepkg(8),\fP \fBpkgtool(8),\fP
\fBupgradepkg(8)\fP
