src/usr/share/man/ru/man8/pkgtool.8
.\" empty
.ds g 
.\" -*- nroff -*-
.\" empty
.ds G 
.de  Tp
.ie \\n(.$=0:((0\\$1)*2u>(\\n(.lu-\\n(.iu)) .TP
.el .TP "\\$1"
..
.\" Like TP, but if specified indent is more than half
.\" the current line-length - indent, use the default indent.
.\"*******************************************************************
.\"
.\" This file was generated with po4a. Translate the source file.
.\"
.\"*******************************************************************
.TH PKGTOOL 8 "24 ноября 1995" "Slackware версия 3.1.0" 
.SH НАЗВАНИЕ
\fBpkgtool\fP \- инструмент обслуживания пакетов программ.
.SH СИНТАКСИС
\fBpkgtool\fP
.LP
\fBpkgtool\fP [ \fB\-\-sets #a#b#c#\fP ] [ \fB\-\-source_mounted\fP ] [
\fB\-\-ignore_tagfiles\fP ] [ \fB\-\-tagfile тегфайл\fP ] [ \fB\-\-source_dir каталог\fP ]
[ \fB\-\-target_dir каталог\fP ] [ \fB\-\-source_device устройство\fP ]
.SH ОПИСАНИЕ
\fBpkgtool\fP \- это управляемый меню инструмент управления пакетами,
предоставляемый дистрибутивом Slackware Linux. Он позволяет пользователю
устанавливать, удалять и просматривать пакеты программного обеспечения через
интерактивную систему. \fBPkgtool\fP может быть использован для повторного
выполнения управляемых меню сценариев, обычно выполняемых в конце установки
Slackware. Это удобно для изменения основных настроек (например, изменение
типа мыши).
.SH ПАРАМЕТРЫ
Большинство пользователей не используют какие\-либо параметры при запуске
\fBpkgtool\fP. Обычно эти параметры используются, только когда \fBpkgtool\fP
запущен при начальной установке системы. Не стесняйтесь пробовать их, но
соблюдайте осторожность.
.TP 
"\fB\-\-sets #A#B#C#\fP"
Установить наборы A, B, C. Разделяйте имена наборов символом "#".
.TP 
\fB\-\-source_mounted\fP
Если указан, \fBpkgtool\fP не будет отмонтировать и заново монтировать
устройство\-источник для каждого диска.
.TP 
\fB\-\-ignore_tagfiles\fP
Если указан, \fBpkgtool\fP будет устанавливать каждый обнаруженный пакет, вне
зависимости от содержимого тегфайлов.
.TP 
\fB\-\-tagfile тегфайл\fP
Позволяет задать используемый для установки тегфайл в командной строке.
.TP 
\fB\-\-source_dir каталог\fP
Используется при установке нескольких пакетов с дисковых наборов. Это
каталог, в котором находятся подкаталоги для каждого диска. Этот параметр не
используется при установке с дискет.
.TP 
\fB\-\-target_dir каталог\fP
Каталог, в котором расположен целевой корневой каталог. При установке на
жестком диске это '/', при установке с установочного диска это, как правило,
\&'/mnt'.
.TP 
\fB\-\-source_device устройство\fP
Устройство\-источник для установки. Не используется, если указан параметр
\fB\-\-source_mounted\fP.
Обычно используется для установки с дискет, например:
 \-\-source_device /dev/fd0u1440
или
 \-\-source_device /dev/fd1h1200
.SH АВТОР
Patrick J. Volkerding <volkerdi@slackware.com>
.SH "СМОТРИТЕ ТАКЖЕ"
\fBmakepkg(8),\fP \fBexplodepkg(8),\fP \fBinstallpkg(8),\fP \fBremovepkg(8),\fP
\fBupgradepkg(8)\fP
