src/usr/share/man/ru/man8/upgradepkg.8
.\" empty
.ds g 
.\" -*- nroff -*-
.\" empty
.ds G 
.de  Tp
.ie \\n(.$=0:((0\\$1)*2u>(\\n(.lu-\\n(.iu)) .TP
.el .TP "\\$1"
..
.\" Like TP, but if specified indent is more than half
.\" the current line-length - indent, use the default indent.
.\"*******************************************************************
.\"
.\" This file was generated with po4a. Translate the source file.
.\"
.\"*******************************************************************
.TH UPGRADEPKG 8 "31 мая 2002" "Slackware версия 8.1.0" 
.SH НАЗВАНИЕ
\fBupgradepkg\fP \- обновляет пакеты Slackware.
.SH СИНТАКСИС
\fBupgradepkg\fP [ \fB\-\-dry\-run\fP ] [ \fB\-\-install\-new\fP ] [ \fB\-\-reinstall\fP ] [
\fB\-\-verbose\fP ] \fBимя_пакета\fP \fB[\fP\fIимя_пакета_2\fP\fB]\fP
.LP
\fBupgradepkg\fP [ \fB\-\-dry\-run\fP ] [ \fB\-\-install\-new\fP ] [ \fB\-\-reinstall\fP ] [
\fB\-\-verbose\fP ] \fBстарый_пакет%новый_пакет\fP \fB[\fP\fIстарый2%новый2\fP\fB]\fP
.SH ОПИСАНИЕ
\fBupgradepkg\fP обновляет пакеты Slackware с одной версии на другую. Это
делается \fBУСТАНОВКОЙ\fP нового пакета в систему и последующим \fBУДАЛЕНИЕМ\fP
любых файлов старого пакета, отсутствующих в новом пакете. Если старый и
новый пакеты имеют одинаковое базовое имя, то достаточно одного
аргумента. Если имена пакетов различаются, то укажите имя старого пакета,
затем знак процента (%) и имя нового пакета без пробелов между ними.

Если с именем старого пакета совпадают по имени несколько установленных
пакетов, \fBupgradepkg\fP удалит их все.
.TP 
Для обновления в каталоге, отличном от / (например, /mnt):
.TP 
ROOT=/mnt upgradepkg пакет.tgz (или .tbz, .tlz, .txz)
.SH ПАРАМЕТРЫ
.TP 
\fB\-\-dry\-run\fP
Выводит отчет о том, какие пакеты будут установлены или обновлены, но
обновление не выполняет.
.TP 
\fB\-\-install\-new\fP
Обычно \fBupgradepkg\fP обновляет только уже установленные пакеты и пропускает
пакеты, не имеющие установленной версии. Задание \fB\-\-install\-new\fP изменяет
это поведение, помимо обновлений будут установлены и новые пакеты.
.TP 
\fB\-\-reinstall\fP
Обычно \fBupgradepkg\fP пропускает пакет, если пакет с таким именем (с
точностью до имени, версии, архитектуры и номера сборки) уже установлен в
системе. Для обновления всех указанных пакетов, даже с совпадающими
версиями, используйте \-\-reinstall.
.TP 
\fB\-\-verbose\fP
Показывать все подробности обновления.
.SH ОШИБКИ
Перед обновлением пакета сохраните все конфигурационные файлы, какие
посчитаете нужными (например, из /etc). Зачастую они не будут затронуты, но
это зависит от структуры пакета. Если хотите, чтобы новые версии
конфигурационных файлов были непременно установлены, вручную удалите их
старые версии перед запуском \fBupgradepkg\fP.
.SH АВТОР
Patrick J. Volkerding <volkerdi@slackware.com>
.SH "СМОТРИТЕ ТАКЖЕ"
\fBmakepkg(8),\fP \fBinstallpkg(8),\fP \fBremovepkg(8),\fP \fBexplodepkg(8),\fP
\fBpkgtool(8)\fP
